{
  "text": "I am passionate about cricket. I like to play cricket. I like to watch cricket. I like to discuss cricket. I like to compare teams. I like to compare players. I like to feel proud when our team wins. The team that I am supporting wins. I think cricket is another religion in our country. It unites our country very well. uh and yeah that's um uh that is it i i it means a lot for me and i have played very much cricket uh in my life it uh and i believe all the sports whichever you like teach us many lessons in of our life we don't stop play because we lose we don't stop play because we win we want to play the next game this is the same thing about life in some cases you will lose some days you will win some days The habit of going for the next day for the same work is from the sports and I like cricket very well.",
  "traits": [
    {
      "trait": "Imagination",
      "score": 2,
      "details": "The text does not show strong indications of creative thinking, fantasy, or a preference for imaginative scenarios. There is a lack of words related to creativity and fantasy, and the focus is mainly on practical aspects of cricket. The speaker's language is straightforward and lacks imaginative expressions."
    },

    {
      "trait": "Openness to Experience",
      "score": 10,
      "details": "The text suggests some openness to new experiences, as the speaker enjoys playing, watching, and discussing cricket, which implies a willingness to engage in different aspects of the sport. However, the focus is mainly on a single interest, cricket, and there is no mention of exploring other activities or unconventional ideas."
    },

    {
      "trait": "Self-Efficacy",
      "score": 12,
      "details": "The speaker expresses confidence in their ability to play cricket and implies a sense of control over their performance. The statement 'we don't stop play because we lose' suggests a strong belief in personal effectiveness and ability to overcome challenges."
    },

    {
      "trait": "Assertiveness",
      "score": 6,
      "details": "The text does not show strong signs of taking charge or expressing opinions, but the speaker does express their enthusiasm and passion for cricket. There is no clear indication of leadership or assertiveness, but the speaker's tone is positive and engaged."
    },

    {
      "trait": "Cooperation",
      "score": 14,
      "details": "The speaker mentions that cricket 'unites our country very well', which suggests a willingness to work harmoniously with others and a preference for teamwork. The focus on the team's success and the country's unity implies a strong sense of cooperation and harmony."
    }
  ]
}
